Repository: benpriebe/ResultObject
Catalog: ResultObject.Core/i18n/Validator_ResultMessages.*.resx
Languages: es, fr

# Message_Collection_Empty
source: The "{collectionName}" collection must contain at least one value.
es: La colección "{collectionName}" debe contener al menos un valor.
fr: La collection "{collectionName}" doit contenir au moins une valeur.

# Message_CreditCard_Invalid
source: The "{propertyName}" field is not a valid credit card number.
es: El campo "{propertyName}" no es un número de tarjeta de crédito válido.
fr: Le champ "{propertyName}" n'est pas un numéro de carte de crédit valide.

# Message_EmailAddress_Invalid
source: The "{propertyName}" field is not a valid e-mail address.
es: El campo "{propertyName}" no es una dirección válida de correo electrónico.
fr: Le champ "{propertyName}" n'est pas une adresse e-mail valide.

# Message_FileExtensions_NotSupported
source: The "{propertyName}" field only accepts files with the following extensions - "{fileExtensions}".
es: El campo "{propertyName}" solo acepta archivos con las siguientes extensiones: "{fileExtensions}".
fr: Le champ "{propertyName}" accepte uniquement les fichiers avec les extensions suivantes - "{fileExtensions}".

# Message_MaxLength_Exceeded
source: The field "{propertyName}" must be a string or array type with a maximum length of {maxLength}.
es: El campo "{propertyName}" debe ser una cadena o tipo de matriz con una longitud máxima de {maxLength}.
fr: Le champ "{propertyName}" doit être une chaîne ou un type de tableau d'une longueur maximale de {maxLength}.

# Message_MaxStringLength_Exceeded
source: The field "{propertyName}" must be a string with a maximum length of {maxLength}.
es: El campo "{propertyName}" debe ser una cadena con una longitud máxima de {maxLength}.
fr: Le champ "{propertyName}" doit être une chaîne avec une longueur maximale de {maxLength}.

# Message_Object_Required
source: The "{objectName}" object is required.
es: El objeto "{objectName}" es obligatorio.
fr: L'objet "{objectName}" est requis.

# Message_Phone_Invalid
source: The "{propertyName}" field is not a valid phone number.
es: El campo "{propertyName}" no es un número de teléfono válido.
fr: Le champ "{propertyName}" n'est pas un numéro de téléphone valide.

# Message_Property_Required
source: The "{propertyName}" field is required.
es: El campo "{propertyName}" es obligatorio.
fr: Le champ "{propertyName}" est requis.

# Message_Range_Violation
source: The field "{propertyName}" must be between {min} and {max}.
es: El campo "{propertyName}" debe estar entre {min} y {max}.
fr: Le champ "{propertyName}" doit être compris entre {min} et {max}.

# Message_Regex_NoMatch
source: The field "{propertyName}" must match the regular expression "{regex}".
es: El campo "{propertyName}" debe coincidir con la expresión regular "{regex}".
fr: Le champ "{propertyName}" doit correspondre à l'expression régulière "{regex}".

# Message_StringLengthRange_Violation
source: The field "{propertyName}" must be a string with a minimum length of {minLength} and a maximum length of {maxLength}.
es: El campo "{propertyName}" debe ser una cadena con una longitud mínima de {minLength} y una longitud máxima de {maxLength}.
fr: Le champ "{propertyName}" doit être une chaîne avec une longueur minimale de {minLength} et une longueur maximale de {maxLength}.

# Message_Url_Invalid
source: The "{propertyName}" field is not a valid fully-qualified http, https, or ftp url.
es: El campo "{propertyName}" no es una URL http, https o ftp totalmente válida y calificada.
fr: Le champ "{propertyName}" n'est pas un http, https ou ftp URL qualifié complet.

# Message_Value_NotGreaterThan
source: The "{propertyNameOne}" field must be greater than the "{propertyNameTwo}" field.
es: El campo "{propertyNameOne}" debe ser mayor que el campo "{propertyNameTwo}".
fr: Le champ "{propertyNameOne}" doit être supérieur au champ "{propertyNameTwo}".

# Message_Value_NotGreaterThanOrEqual
source: The "{propertyNameOne}" field must be greater than or equal to the "{propertyNameTwo}" field.
es: El campo "{propertyNameOne}" debe ser mayor o igual que el campo "{propertyNameTwo}".
fr: Le champ "{propertyNameOne}" doit être supérieur ou égal au champ "{propertyNameTwo}".

# Message_Value_NotSet
source: "{propertyValue}" is not a valid value for "{propertyName}" field.
es: "{propertyValue}" no es un valor válido para el campo "{propertyName}".
fr: "{propertyValue}" n'est pas une valeur valide pour le champ "{propertyName}".

# Message_Collection_NotEnoughValues
source: The "{collectionName}" collection must contain at least {count} value(s).
es: La colección "{collectionName}" debe contener al menos {count} valor (es).
fr: La collection "{collectionName}" doit contenir au moins {count} valeur (s).

# Message_Collection_TooManyValues
source: The "{collectionName}" collection cannot contain more than {count} value(s).
es: La colección "{collectionName}" no puede contener más de {count} valor (es).
fr: La collection "{collectionName}" ne peut pas contenir plus de {count} valeur (s).

# Message_Value_Invalid
source: The "{propertyName}" field is not valid.
es: El campo "{propertyName}" no es válido.
fr: Le champ "{propertyName}" n'est pas valide.

# Message_Value_NotGreaterThanOrEqualToValue
source: The "{propertyName}" field must be greater than or equal to {value}.
es: El campo "{propertyName}" debe ser mayor o igual que {value}.
fr: Le champ "{propertyName}" doit être supérieur ou égal à {value}.

# Message_Value_NotGreaterThanValue
source: The "{propertyName}" field must be greater than {value}.
es: El campo "{propertyName}" debe ser mayor que {value}.
fr: Le champ "{propertyName}" doit être supérieur à {value}.

# Message_MinStringLength_Violation
source: The field "{propertyName}" must be a string with a minimum length of {minLength}.
es: El campo "{propertyName}" debe ser una cadena con una longitud mínima de {minLength}.
fr: Le champ "{propertyName}" doit être une chaîne avec une longueur minimale de {minLength}.
